constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("myFvMotionSolvers.so");

// motionSolver    velocityLaplacian;
motionSolver    displacementLaplacian;
// Use either velocityLaplacian or displacementLaplacian

diffusivity     quadratic inverseDistance (hull);
// See src/fvMotionSolver/motionDiffusivity for available diffusivity models.

// ************************************************************************* //
